## 事务

- `Redis`事务执行的特点：
  - 一次性；`Redis`的事务执行本质上就是一组命令集合，一次性提交，一次性执行；
  - 顺序性；提交的一组命令，按命令编写顺序（进入列的顺序）执行。
  - 排他性；
- `Redis`事务没有隔离级别的概念，就是没有脏读，幻读这些；
- 所有队列中的指令输入时都不会立刻执行，只有在使用`exec`指令（执行事务指令）后才会执行。
- Redis单条指令有原子性，事务没有原子性，即执行时不加锁，会有并发问题。
- 事务步骤
  - 开启事务：`multi`指令；
  - 命令入列：一组指令；
  - 执行事务：`exec`指令；
- 示例：

``` bash
localhost:6301> multi 			# 开启事务
OK
localhost:6301> set name v1		#输入指令，指令入列
QUEUED
localhost:6301> set db v2
QUEUED
localhost:6301> get date		#这里获取队列中没有的键，用于验证事务的按顺序执行
QUEUED
localhost:6301> get name
QUEUED
localhost:6301> set date 1998
QUEUED
localhost:6301> get date
QUEUED
localhost:6301> exec			#执行事务
1) OK
2) OK
3) (nil)
4) "v1"
5) OK
6) "1998"
```

取消事务

DISCARD

``` bash
localhost:6301> multi
OK
localhost:6301> set k1 v1
QUEUED
localhost:6301> discard
OK
localhost:6301> get k1
(nil)
```

指令编译错误，不会执行队列中所有指令

```bash
localhost:6301> multi
OK
localhost:6301> set k1 v1
QUEUED
localhost:6301> set k2 v2
QUEUED
localhost:6301> get set k1				# 使用编译失败的指令，直接报错
(error) ERR wrong number of arguments for 'get' command
localhost:6301> set k3 v4				# 队列中有指令编译报错，但仍可以对队列输入指令
QUEUED
localhost:6301> exec
(error) EXECABORT Transaction discarded because of previous errors.
localhost:6301> get k1					# 队列中的指令没有执行
(nil)
```

运行队列指令时，某个指令报错，则报错的指令执行，其他指令仍生效（redis事务没有原子性）

``` bash
localhost:6301> set k1 "v" 		#这里事先放入一个字符串
OK
localhost:6301> multi
OK
localhost:6301> incr k1			#事务中对k1字符串进行自增，编译通过但是执行会失败
QUEUED
localhost:6301> set k2 v2
QUEUED
localhost:6301> exec
1) (error) ERR value is not an integer or out of range	#可以看到执行显示报错
2) OK
localhost:6301> get k2			#后续指令执行成功
"v2"
```



#### 监控 watch

> 悲观锁

- 任何时候都加锁。

> 乐观锁

- 任何时候都不加锁，只有在更新数据的时候判断一下，看是否有人在操作期间修改过数据；

使用watch监视数据变化

正常执行线程。

```bash
127.0.0.1:6301> set in 100
OK
127.0.0.1:6301> set out 0
OK
127.0.0.1:6301> watch in	#监控
OK
127.0.0.1:6301> watch out	#监控
OK
127.0.0.1:6301> multi
OK
127.0.0.1:6301> decrby in 20
QUEUED
127.0.0.1:6301> incrby out 20
QUEUED
127.0.0.1:6301> exec
1) (integer) 80			#显示数据
2) (integer) 20
```

多线程下数据被修改了，事务提交后将执行失败

``` bash
127.0.0.1:6301> watch in
OK
127.0.0.1:6301> multi
OK
127.0.0.1:6301> decrby in 20
QUEUED
127.0.0.1:6301> incrby out 20 	#此时，另外起一个窗口将in的value值修改成200
QUEUED
127.0.0.1:6301> exec
(nil)							#由于in被修改了,所以事务提交执行失败
```

使用unwatch解锁

```bash
127.0.0.1:6301> watch in
OK
127.0.0.1:6301> unwatch			#注意这里只需要写入unwatch即可，不需要加参数
OK
```

